#На вход программе подаются три целых числа, каждое на отдельной строке.
#Программа должна вывести сумму введённых чисел.
print(int(input()) + int(input()) + int(input()))