#На вход программе подаётся целое положительное число.
#Программа должна вывести текст согласно условию задачи.x---2x---3x---4x---5x
x = int(input())
x_2 = x * 2
x_3 = x * 3
x_4 = x * 4
x_5 = x * 5
print(x, x_2, x_3, x_4, x_5, sep='---')