#На вход программе подаются два целых числа (каждое на отдельной строке): a и b
#Программа должна вывести текст в соответствии с условием задачи.
a = int(input())
b = int(input())
print(a, '+', b, '=', a+b)
print(a, '-', b, '=', a-b)
print(a, '*', b, '=', a*b)