#На вход программе подаётся одно целое число.
#Программа должна вывести три последовательно идущих числа в соответствии с условием задачи.
first_number = int(input())
second_number = first_number + 1
third_number = second_number + 1
print(first_number, second_number, third_number, sep = '\n')