#На вход программе подаются три целых числа, каждое на отдельной строке.
#Программа должна вывести сумму введённых чисел.
first_number = int(input())
second_number = int(input())
third_number = int(input())
print(first_number + second_number + third_number)