#На вход программе подается пять действительных чисел, каждое на отдельной строке.
#Программа должна вывести одно число – сумму модулей введённых чисел.

nmb_1 = float(input())
nmb_2 = float(input())
nmb_3 = float(input())
nmb_4 = float(input())
nmb_5 = float(input())

print(abs(nmb_1) + abs(nmb_2) + abs(nmb_3) + abs(nmb_4) + abs(nmb_5))