#На вход программе подаётся положительное действительное число.
#Выведите его дробную часть.

typed_nmb = float(input())
print(typed_nmb - (int(typed_nmb)))