#Напишите программу, которая считывает длины двух катетов в прямоугольном треугольнике и выводит его площадь.
#На вход программе подаются два действительных числа (каждое на отдельной строке) – длины катетов.
#Программа должна вывести одно число – площадь треугольника.

print(float(input()) * float(input())/2)