#На вход программе подаётся одно действительное число – температура в градусах по шкале Фаренгейта.
#Программа должна вывести одно действительное число – температуру в градусах по шкале Цельсия.

temperature_in_F = float(input())
print((5/9)*(temperature_in_F - 32))
