#На вход программе подается одно число n.
# Напишите программу, которая выводит список [1, 2, 3, ..., n].

typed_nmb = int(input())
print(list(range(1, typed_nmb + 1)))