#На вход программе подаются три строки, каждая на отдельной строчке.
#Программа должна вывести введенные строки в той же последовательности, каждую на отдельной строке.
first_row = input()
second_row = input()
third_row = input()

print(first_row)
print(second_row)
print(third_row)