#На вход программе подаётся одна строка — имя человека.
#Программа должна вывести текст в соответствии с условием задачи. Привет, <имя человека>
input_name = input()
print('Hi,', input_name)