#На вход программе подается три строки, каждая на отдельной строке.
#Программа должна вывести введенные строки в обратной последовательности, каждую на отдельной строке.
first_row = input()
second_row = input()
third_row = input()
print(third_row, second_row, first_row, sep='\n')