#На вход программе подаются три строки, каждая на отдельной строчке.
#Программа должна вывести введенные строки в той же последовательности, каждую на отдельной строке.
print(input())
print(input())
print(input())