# Напишите программу, которая выводит на экран следующий текст:Hello, world!
print('Hello, world!')