#На вход программе подаются две строки.
#Программа должна вывести одну строку в соответствии с условием задачи.
if input() == input():
    print("Password accepted")
else:
    print("Password not accepted")