#На вход программе подаётся одно целое число.
#Программа должна вывести «Четное» (без кавычек), если число четное, или «Нечетное» (без кавычек) в противном случае.
if int(input()) % 2 == 0:
    print('Even number')
else:
    print('Not Even number')