#На вход программе подаются четыре строки (каждая на отдельной строке): строка-разделитель и три строки.
#Программа должна вывести введённые три строки через разделитель.
separator = input()
print(input(), input(), input(), sep = separator)