#Напишите программу, которая приветствует пользователя в следующем формате:Привет, <имя пользователя>!
print('Hi', input(), sep=', ', end='!')