#Напишите программу, которая приветствует пользователя в следующем формате:Привет, <имя пользователя>!
name = input()
print('Hi', name, sep=', ', end='!')