#Напишите программу, которая считывает с клавиатуры две строки – имя и фамилию пользователя и выводит фразу:
#Hello <введённое имя> <введённая фамилия>! You have just delved into Python
#На вход программе подаются две строки (имя и фамилия), каждая на отдельной строке.

print('Hello' + ' ' + input() + ' ' + input() + '!' + ' ' + 'You have just delved into Python')