#Напишите программу, которая считывает одну строку, после чего выводит «YES», если во введённой строке есть подстрока «синий»,
# или «NO» в противном случае.

if 'blue' in input():
    print('YES')
else:
    print('NO')