#На вход программе подаётся натуральное число – количество сантиметров
#Программа должна вывести одно число – полное число метров.
print(int(input()) // 100)