#На вход программе подаются три целых числа b1, q, n каждое на отдельной строке.
#Программа должна вывести  n-й член геометрической прогрессии.
print(int(input()) * int(input()) ** (int(input()) - 1))

