#На вход программе подается строка текста. Напишите программу, которая удаляет все вхождения символа «@».

typed_text = input()
print(typed_text.replace('@', ''))